Revit 2024 API
BuiltInFailures.ColumnInsideWallFailures.StartCutShadowJoin Property
 Two joined walls are in a position to allow automatic insert copying.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StartCutShadowJoin { get; }
Visual Basic
Public Shared ReadOnly Property StartCutShadowJoin As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StartCutShadowJoin {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace